const RegExp = {
  // 手机号
  PHONE: /^1[3-9][0-9]{9}$/,
  // 16位虚拟手机号
  VIRTUAL_PHONE: /^(\d|-){16}$/,
  // 固定电话/座机号
  LANDLINE_PHONE: /^0\d{2,3}-?\d{7,8}$/,
  // 身份证号
  ID_NUMBER: /^[1-9]\d{5}(19|20)\d{2}((0[1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
  // URL
  URL: /(http|ftp|https):\/\/([\w_-]+(?:(?:\.[\w_-]+)+))([\w.,@?^=%&:/~+#-]*[\w@?^=%&/~+#-])?/,
  // 邮箱
  EMAIL: /^[a-zA-Z0-9.!#$%&'*+/=?^_`{|}~-]+@[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(?:\.[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/
}

export default RegExp